www/terraform_configs/82ae7cbd-6903-4ebb-87a8-7a8ecc5441d5/.govmomi/debug/2025-05-30T13-06-11.0989738/1-0055.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/"><Body><RetrievePropertiesEx xmlns="urn:vim25"><_this type="PropertyCollector">propertyCollector</_this><specSet><propSet><type>Folder</type><pathSet>name</pathSet><pathSet>childType</pathSet></propSet><propSet><type>Datacenter</type><pathSet>name</pathSet></propSet><propSet><type>VirtualApp</type><pathSet>name</pathSet></propSet><propSet><type>VirtualMachine</type><pathSet>name</pathSet></propSet><propSet><type>Network</type><pathSet>name</pathSet></propSet><propSet><type>ComputeResource</type><pathSet>name</pathSet><pathSet>resourcePool</pathSet></propSet><propSet><type>ClusterComputeResource</type><pathSet>name</pathSet><pathSet>resourcePool</pathSet></propSet><propSet><type>Datastore</type><pathSet>name</pathSet></propSet><propSet><type>DistributedVirtualSwitch</type><pathSet>name</pathSet></propSet><objectSet><obj type="Folder">group-n4827856</obj><skip>true</skip><selectSet xmlns:XMLSchema-instance="http://www.w3.org/2001/XMLSchema-instance" XMLSchema-instance:type="TraversalSpec"><type>Folder</type><path>childEntity</path><skip>false</skip></selectSet></objectSet></specSet><options></options></RetrievePropertiesEx></Body></Envelope>